/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */

"btn_pay" = "Pay";
"btn_submit" = "Submit";
"btn_next" = "Next";
"btn_skip" = "Skip";

"btn_send_sms" = "Send SMS";
"btn_resend_sms" = "Resend after \n%d sec";

/* 界面 - JP 收银台 */
"navbar_checkout_title" = "Payment";
"btn_checkout_agreement" = "I agreed to JollyPay agreement and save this card for future use";
"btn_checkout_agreement_highlight" = "JollyPay agreement";

"label_checkout_completion_time" = "Complete the payment in";

"cell_label_checkout_default_tips" = "Pay with debit/credit card";
"cell_label_checkout_default_change" = "Change";
"cell_label_checkout_discount" = "Discount";

"cell_label_paymethod_balance" = "Balance";
"cell_label_paymethod_balance_left" = "Left";
"cell_label_paymethod_balance_invalid" = "Order amount exceeds available balance";

/* 界面 - 收银台加载异常 */
"label_loadingerror_inited_title" = "Initialization Failed";
"label_loadingerror_inited_detail" = "Please return and try again.";
"btn_loadingerror_inited_operation" = "Try again";

"label_loadingerror_network_title" = "OOPS";
"label_loadingerror_network_detail" = "Please check your network connection";
"btn_loadingerror_network_operation" = "Try again";

"label_loadingerror_unusual_detail" = "Sorry, but your account has been locked due to abnormal activities. Please try another payment method.";
"btn_loadingerror_unusual_operation" = "Back";

/* 界面 - 银行卡组件 */
"placeholder_bankpayment_card_number" = "Card Number";
"placeholder_bankpayment_mmyy" = "MM/YY";
"placeholder_bankpayment_cvvcode" = "CVV2 Code";
"placeholder_bankpayment_card_holder_name" = "Name on Card(Optional)";

/* 界面 - 银行卡支付 */
"label_bankpayment_mada" = "This card is a Mada card.";

/* 界面 - 银行卡验证 */
"label_validcard_header_title" = "Update your card information";
"label_validcard_header_description" = "The payment option in your account that used %@ ending in %@ need to be updated to complete this transaction";
"btn_validcard_delete" = "Forgot or lost？Delete this card";
"btn_validcard_delete_highlight" = "Delete this card";
"tips_validcard_delete" = "If you want to delete %@ %@, click confirm.";

/* 界面 - SADAD 支付 */
"placeholder_sadad_account" = "Enter online payment ID Alias";
"btn_sadad_change" = "Want to change it?";
"label_sadad_description" = "Please Note:\n1. You can use SADAD with almost all Saudi Banks.\n2. SADAD online payment is different from normal SADAD. With this method you don't need a 'Biller Code'.\n\nDon't have a SADAD Account?\nNo problem, please follow these steps & complete your payment.\n\n1. Login to your bank account and subscribe to SADAD service.\n2. Enter your SADAD username that was created previously with your bank account.\n3. Enter your registered password.\n4. Enter the one time password (OTP) sent to your mobile.\n5. Confirm and complete the payment.";
"lable_sadad_title" = "Payment Amount";

/* 界面 - 绑定手机 */
"label_bindphone_title" = "Bind your mobile number";
"label_bindphone_description" = "For your safety of your account, please bind your mobile number first.";
"label_bindphone_region_title" = "Region";
"label_bindphone_region_value" = "Saudi Arabia";
"label_bindphone_note" = "Note：Verification Code will be sent to the mobile phone when you make a payment with bank cards in your account. please make sure the mobile number is yours.";

/* 界面 - 选择手机国家码 */
"label_selectcountry_title" = "Please Select";

/* 界面 - 验证手机号 */
"label_validphone_title" = "SMS verification";
"label_validphone_description" = "Verification code has been sent to : ";
"placeholder_validphone_smscode" = "Verification Code";
"placeHolder_validphone_number" = "Mobile number";

/* 界面 - 支付密码设置 */
"label_setpassword_title" = "Set payment password";
"label_setpassword_description" = "Payment password will be needed every time when you make a payment with bank cards in your account. Please set it carefully and memorize it.";
"label_resetpassword_title" = "Reset the payment password";
"label_comfirmpassword_title" = "Confirm payment password";
"label_setpassword_payment_title" = "Password Setting";
"label_couponinfo_description" = "%@ discount will be used for this transaction.";

/* 界面 - 快捷支付 */
"label_quickpayment_inputpwd_title" = "Enter Payment Password";
"btn_quickpayment_inputpwd_forgot" = "Forgot password ?";
"label_quickpayment_inputsms_title" = "SMS Verification";
"label_quickpayment_inputsms_description" = "Transaction requires SMS confirmation. Verification code sent to mobile: ";

/* 界面 - 支付结果 */
"label_result_success_title" = "Completed";
"label_result_success_detail" = "The payment was successful";

"label_result_pending_title" = "Pending/Processing";
"label_result_pending_detail" = "The payment is awaiting processing. The payment is in progress.";

"label_result_error_title" = "ERROR";
"label_result_error_detail" = "This transaction can't be completed due to the insufficient balance.";

"label_result_oops_title" = "OOPS";
"label_result_oops_detail" = "Please check your network connection";

/* 界面 - 用户协议 */
"navbar_agreement_title" = "Agreement";

/* 界面 - 3DS 支付 */
"navbar_3ds_title" = "3D Secure Verification";

/* 界面 - 银行卡支付中绑卡 */
"label_payment_bindcard_note" = "To save this card, you must verify your mobile phone to set payment password";

/* 提示信息 */
"tips_action_ok" = "OK";
"tips_action_cancel" = "Cancel";
"tips_action_goto_setup" = "Go to set up";
"tips_action_verify_sms" = "Verify by SMS Code";
"tips_action_retry" = "Try again";
"tips_action_confirm" = "Confirm";
"tips_action_enable" = "Enable";
"tips_action_enter_pwd" = "Enter password";

"tips_operation_success" = "Success";
"tips_operation_processing" = "Processing";

"tips_network_timeout" = "Time out due to system error.";
"tips_response_order_expired" = "Sorry, the order is expired.";
"tips_response_error" = "Unknow Error. It is not possible to clearly assess the cause of the issue. Please, try again";

"tips_checkout_setpwd" = "Please set up your payment password before paying";

"tips_title_invalid_pwd" = "Incorrect password";
"tips_quickpaymentcode_invalid_twice" = "Incorrect password. You can try twice more or use verification code";
"tips_quickpaymentcode_invalid_once" = "Incorrect password. You can try once more.";

"tips_sadad_invalid_account" = "SADAD Account ID Alias must have alphanumeric characters";
"tips_sadad_length_account" = "SADAD Account ID Alias should have minimum 6 characters and maximum 12 characters";

/* 手机号校验 */
"tips_phone_invalid_length" = "Your mobile phone number should be %@ digits long";
"tips_phone_invalid_prefix" = "Your mobile phone number should start with %@";
"tips_phone_invalid" = "Please enter valid mobile phone number";

"tips_verification_sended" = "Verification Code has been send to your mobile phone";
"tips_verification_invalid" = "Please enter valid Verification Code";

"tips_password_warning_weak" = "Password is too weak, please re-enter";
"tips_password_error_match" = "The two passwords you entered did not match. Please re-enter.";

"tips_payment_bankcard_notsupported" = "Sorry, we can't support this card";
"tips_currency_charged_description" = "You will be charged %@";

"tips_payment_timeout" = "Transaction timed out";

/* 生物验证 */
"tips_authid_enable_title" = "Enable Face/Touch Pay for JollyPay";
"tips_authid_allow_description" = "Please verify your %@";
"tips_authid_face" = "Face ID";
"tips_authid_touch" = "Touch ID";
"tips_authid_locked" = "Unlock your mobile phone";

/* 退出收银台 */
"tips_checkout_exit" = "Payment incomplete, continue to exit?";

/* Session 失效 */
"response_msg_session_expired" = "Sorry, the session is expired.";
/* 营销系统 - 红包无效 */
"response_msg_coupon_invalid" = "Sorry, the coupon can not be used, please try again.";
/* 手机号 - 已被使用 */
"response_msg_phone_bind_used" = "The mobile phone has been used, please use a different mobile phone number.";
/* 验证码 - 发送失败 */
"response_msg_phone_sms_send_failure" = "Failed to send verification. Please try again.";
/* 验证码 - 手机号被锁 */
"response_msg_phone_sms_locked" = "Sorry, you have failed %@ times. The function will be locked for %@ mins.";
/* 支付 - 转汇查询超时 */
"response_msg_currency_timeout" = "Failed to query exchange rate. Tap to query again.";
/* 支付 - 币种不支持 */
"response_msg_currency_not_supported" = "Sorry, we can't support the currency";
/* 支付 - 预路由失败 */
"response_msg_payment_preouting_error" = "Unable To Route Transaction. Please try again.";
/* 支付 - 风控拦截 */
"response_msg_payment_intercepted" = "The transaction did not go through due to the order is in high risk.";
/* 支付 - 支付账号被锁 */
"response_msg_payment_account_locked" = "Sorry, you have failed multiple times. your account will be locked for %@ mins.";
/* 银行卡 - 绑卡超出范围 */
"response_msg_bankcard_bind_outrnage" = "Sorry, but you can only add %@ cards to your account.";
/* 银行卡 - 绑卡失败 */
"response_msg_bankcard_bind_failure" = "Failed to add bank card.";
/* 银行卡 - 重复绑卡 */
"response_msg_bankcard_bind_again" = "Bank card has been added. Please do not add it again.";
/* 银行卡 - 更新失败 */
"response_msg_bankcard_update_failure" = "Failed to update bank information.";
/* 银行卡 - 删除失败 */
"response_msg_bankcard_remove_failure" = "Failed to removed bank card. Please try again.";

// 原始
"payment_method_sadad" = "Sadad";
"payment_method_mada" = "Mada";
